Revit 2027 API
RailTagentJoinOption Enumeration
 The tangent joins of the rails.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum RailTagentJoinOption
Public Enumeration RailTagentJoinOption
public enum class RailTagentJoinOption
type RailTagentJoinOption
Members
Member name | Value | Description
AddVerticalOrHorizontalSegments | 0 |  Add vertical or horizontal segments.
ExtendRailsToMeet | 2 |  Extend rails to meet.
NoConnector | 1 |  No connector.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace